In [1]:
# further resources for Numpy
"""
https://www.pythontutorial.net/python-numpy/
"""

'\nhttps://www.pythontutorial.net/python-numpy/\n'

In [3]:
import pandas as pd
results = {
    'names' : ['Tola', 'Tosin', 'Tobi', 'Titi', 'Tayo', 'Tolu', 'Tom'],
    'scores': [40, 60, 70, 54, 90, 63, 82],
    'grades': ['E', 'B', 'A', 'C', 'A', 'B', 'A'],
    'gender': ['M', 'F', 'M', 'F', 'F', 'F', 'M'],
    'emails': ['tola@gmail.com', 'tosin@gmail.com', 'tobi@gmail.com', 'titi@gmail.com', 'tayo@gmail.com', 'tolu@gmail.com', 'tom@gmail.com']
}

df = pd.DataFrame(results)
df

   names  scores grades gender           emails
0   Tola      40      E      M   tola@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
3   Titi      54      C      F   titi@gmail.com
4   Tayo      90      A      F   tayo@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
6    Tom      82      A      M    tom@gmail.com

In [5]:
# sorting data
df.sort_values(by='scores')

   names  scores grades gender           emails
0   Tola      40      E      M   tola@gmail.com
3   Titi      54      C      F   titi@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
6    Tom      82      A      M    tom@gmail.com
4   Tayo      90      A      F   tayo@gmail.com

In [7]:
# sorting data
df.sort_values(by='scores', ascending=False)

   names  scores grades gender           emails
4   Tayo      90      A      F   tayo@gmail.com
6    Tom      82      A      M    tom@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
3   Titi      54      C      F   titi@gmail.com
0   Tola      40      E      M   tola@gmail.com

In [9]:
df['names'].sort_values()

4     Tayo
3     Titi
2     Tobi
0     Tola
5     Tolu
6      Tom
1    Tosin
Name: names, dtype: object

In [11]:
# sorting data
df.sort_values(by='grades', ascending=False)

   names  scores grades gender           emails
0   Tola      40      E      M   tola@gmail.com
3   Titi      54      C      F   titi@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
4   Tayo      90      A      F   tayo@gmail.com
6    Tom      82      A      M    tom@gmail.com

In [13]:
# sorting data using multiple columns
df.sort_values(by=['grades', 'scores'], ascending=[False, True])

   names  scores grades gender           emails
0   Tola      40      E      M   tola@gmail.com
3   Titi      54      C      F   titi@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
6    Tom      82      A      M    tom@gmail.com
4   Tayo      90      A      F   tayo@gmail.com

In [15]:
# grouping and aggregating data
# aggregating using describe()
df.describe()

          scores
count   7.000000
mean   65.571429
std    16.890403
min    40.000000
25%    57.000000
50%    63.000000
75%    76.000000
max    90.000000

In [17]:
df['scores'].median()

63.0

In [19]:
df['scores'].mean()

65.57142857142857

In [21]:
df['scores'].sum()

459

In [25]:
df.groupby('gender')

In [27]:
# groups property shows each group and the row index for each group in a dictionary
gender_group = df.groupby('gender')
gender_group.groups

{'F': [1, 3, 4, 5], 'M': [0, 2, 6]}

In [31]:
# ngroups property shows the number of groups found.
gender_group.ngroups

2

In [33]:
# shows each group name.
gender_group.groups.keys()

dict_keys(['F', 'M'])

In [35]:
# get_group will return the data for the selected group
gender_group.get_group('F')

   names  scores grades gender           emails
1  Tosin      60      B      F  tosin@gmail.com
3   Titi      54      C      F   titi@gmail.com
4   Tayo      90      A      F   tayo@gmail.com
5   Tolu      63      B      F   tolu@gmail.com

In [37]:
gender_group.get_group('M')

  names  scores grades gender          emails
0  Tola      40      E      M  tola@gmail.com
2  Tobi      70      A      M  tobi@gmail.com
6   Tom      82      A      M   tom@gmail.com

In [39]:
gender_group.get_group('M').max()

names               Tom
scores               82
grades                E
gender                M
emails    tom@gmail.com
dtype: object

In [41]:
gender_group.get_group('F').max()

names               Tosin
scores                 90
grades                  C
gender                  F
emails    tosin@gmail.com
dtype: object

In [43]:
# multiple aggregations.
aggs = df.groupby('gender')['scores'].agg(['mean', 'max'])
aggs

         mean  max
gender
F       66.75   90
M       64.00   82

In [45]:
# multiple aggregations.
aggs = df.groupby('gender')['scores'].agg(['mean', 'max', 'min', 'std', 'median'])
aggs

         mean  max  min        std  median
gender
F       66.75   90   54  15.945219    61.5
M       64.00   82   40  21.633308    70.0

In [47]:
gender_group

In [49]:
gender_group['grades'].value_counts()

gender  grades
F       B         2
        A         1
        C         1
M       A         2
        E         1
Name: count, dtype: int64

In [51]:
df

   names  scores grades gender           emails
0   Tola      40      E      M   tola@gmail.com
1  Tosin      60      B      F  tosin@gmail.com
2   Tobi      70      A      M   tobi@gmail.com
3   Titi      54      C      F   titi@gmail.com
4   Tayo      90      A      F   tayo@gmail.com
5   Tolu      63      B      F   tolu@gmail.com
6    Tom      82      A      M    tom@gmail.com

In [53]:
df['grades'].value_counts()

grades
A    3
B    2
E    1
C    1
Name: count, dtype: int64

In [57]:
# nlargest() method - the largest value in each group
gender_group['scores'].nlargest(1)

gender
F       4    90
M       6    82
Name: scores, dtype: int64

In [59]:
# nlargest() method - the largest 2 values in each group.
gender_group['scores'].nlargest(2)

gender
F       4    90
        5    63
M       6    82
        2    70
Name: scores, dtype: int64